{
  "MAT-000": {
    "is-active": false,
    "title": "Template Course",
    "credit-hours": "3",
    "class-hours": "3",
    "lab-hours": "0",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "",
    "slos": [
      "SLO1: ",
      "SLO2: ",
      "SLO3: ",
      "SLO4: ",
      "SLO5: ",
      "SLO6: ",
      "SLO7: ",
      "SLO8: "
    ]
  },
  "MAT-110": {
    "is-active": true,
    "title": "Math Measurement & Literacy",
    "credit-hours": "3",
    "class-hours": "2",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course provides an activity-based approach that develops measurement skills and mathematical literacy using technology to solve problems for non-math intensive programs. Topics include unit conversions and estimation within a variety of measurement systems; ratio and proportion; basic geometric concepts; financial literacy; and statistics including measures of central tendency, dispersion, and charting of data. Upon completion, students should be able to demonstrate the use of mathematics and technology to solve practical problems, and to analyze and communicate results.",
    "slos": [
      "SLO1: Demonstrate estimation skills.",
      "SLO2: Justify results of estimation.",
      "SLO3: Use dimensional analysis to convert units of measurement.",
      "SLO4: Employ fractions, percentages and proportions to solve contextual problems.",
      "SLO5: Compute geometric measurements of perimeter, area, volume and angles.",
      "SLO6: Use technology to analyze and interpret elements of personal finance.",
      "SLO7: Compare and contrast measures of center and measures of dispersion.",
      "SLO8: Interpret tables, charts, and graphs.",
      "SLO9: Use tables, charts, and graphs to communicate results of data.",
      "SLO10: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-121": {
    "is-active": true,
    "title": "Algebra/Trigonometry I",
    "credit-hours": "3",
    "class-hours": "2",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course provides an integrated approach to technology and the skills required to manipulate, display, and interpret mathematical functions and formulas used in problem solving. Topics include the properties of plane and solid geometry, area and volume, and basic proportion applications; simplification, evaluation, and solving of algebraic equations and inequalities and radical functions; complex numbers; right triangle trigonometry; and systems of equations. Upon completion, students will be able to demonstrate the ability to use mathematics and technology for problem-solving, analyzing and communicating results.",
    "slos": [
      "SLO1: Use geometric principles to solve industrial application problems involving perimeter, area, and volume. (CCL)",
      "SLO2: Employ basic algebraic operations to simplify, evaluate, and solve proportions, radical and other algebraic functions, equations, and inequalities. (CCL)",
      "SLO3: Perform basic algebraic operations involving complex numbers. (CCL)",
      "SLO4: Solve applied problems using trigonometric principles involving right triangles. (CCL)",
      "SLO5: Solve applied problems using systems of equations involving two and three variables. (CCL)",
      "SLO6: Use technology to solve practical problems and communicate results. (CCL)",
      "SLO8: Apply quantitative reasoning to solve problems. (CCL)"
    ]
  },
  "MAT-122": {
    "is-active": true,
    "title": "Algebra/Trigonometry II",
    "credit-hours": "3",
    "class-hours": "2",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to cover concepts in algebra, function analysis, and trigonometry. Topics include exponential and logarithmic functions, transformations of functions, Law of Sines, Law of Cosines, vectors, and statistics. Upon completion, students should be able to demonstrate the ability to use mathematics and technology for problem-solving, analyzing and communicating results.",
    "slos": [
      "SLO1: Solve relevant contextual problems involving exponential and logarithmic functions. (CCL)",
      "SLO2: Interpret and create transformations of functions. (CCL)",
      "SLO3: Utilize the Law of Sines and Law of Cosines to solve oblique triangles and their applications. (CCL)",
      "SLO4: Define vectors and compute vector operations. (CCL)",
      "SLO5: Apply vector concepts to solve applications. (CCL)",
      "SLO6: Employ basic statistical concepts to summarize and present data and draw conclusions. (CCL)",
      "SLO7: Apply quantitative reasoning to solve problems. (CCL)"
    ]
  },
  "MAT-143": {
    "is-active": true,
    "title": "Precalculus Trigonometry",
    "credit-hours": "3",
    "class-hours": "2",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "",
    "slos": [
      "SLO1: Judge the reasonableness of results using estimation, logical processes, and a proper understanding of quantity.",
      "SLO2: Utilize proportional reasoning to make conversions involving various units of measurement.",
      "SLO3: Identify linear and exponential rates of growth to make predictions and informed decisions based on data and graphs.",
      "SLO4: Evaluate linear and exponential rates of growth to make predictions and informed decisions based on data and graphs.",
      "SLO5: Differentiate between simple and compound interest.",
      "SLO6: Analyze the long-term effects of saving, investing, and borrowing.",
      "SLO7: Describe statistical information such as graphs, tables, and summarized data to draw appropriate conclusions when presented with actual statistical studies.",
      "SLO8: Analyze statistical information such as graphs, tables, and summarized data to draw appropriate conclusions when presented with actual statistical studies.",
      "SLO9: Interpret statistical information such as graphs, tables, and summarized data to draw appropriate conclusions when presented with actual statistical studies.",
      "SLO10: Determine probabilities and expected values.",
      "SLO11: Use probabilities and expected values to assess risk and make informed decisions.",
      "SLO12: Analyze civic and/or societal issues to solve contextual problems.",
      "SLO13: Critique decisions using relevant mathematics.",
      "SLO14: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-152": {
    "is-active": true,
    "title": "Statistical Methods I",
    "credit-hours": "4",
    "class-hours": "3",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course provides a project-based approach to introductory statistics with an emphasis on using real-world data and statistical literacy. Topics include descriptive statistics, correlation and regression, basic probability, discrete and continuous probability distributions, confidence intervals and hypothesis testing. Upon completion, students should be able to use appropriate technology to describe important characteristics of a data set, draw inferences about a population from sample data, and interpret and communicate results.",
    "slos": [
      "SLO1: Organize data.",
      "SLO2: Construct appropriate graphs of data.",
      "SLO3: Calculate descriptive statistics.",
      "SLO4: Interpret descriptive statistics.",
      "SLO5: Apply basic rules of probability.",
      "SLO6: Identify appropriate probability distributions.",
      "SLO7: Apply appropriate probability distributions.",
      "SLO8: Perform regression analysis.",
      "SLO9: Analyze sample data to draw inferences about a population parameter.",
      "SLO10: Communicate results using a variety of methods.",
      "SLO11: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-167": {
    "is-active": true,
    "title": "Discrete Mathematics",
    "credit-hours": "3",
    "class-hours": "3",
    "lab-hours": "0",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "",
    "slos": [
      "SLO1: ",
      "SLO2: ",
      "SLO3: ",
      "SLO4: ",
      "SLO5: ",
      "SLO6: ",
      "SLO7: ",
      "SLO8: "
    ]
  },
  "MAT-171": {
    "is-active": true,
    "title": "Precalculus Algebra",
    "credit-hours": "4",
    "class-hours": "3",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to develop topics which are fundamental to the study of Calculus. Emphasis is placed on solving equations and inequalities, solving systems of equations and inequalities, and  analysis of functions (absolute value, radical, polynomial, rational, exponential, and logarithmic) in multiple representations. Upon completion, students should be able to select and use appropriate models and techniques for finding solutions to algebra-related problems with and without technology. This course has been approved for transfer under the CAA as a general education course in Mathematics. This course has been approved for transfer under the ICAA as a general education course in Mathematics.",
    "slos": [
      "SLO1: Use analytical, graphical, and numerical representations to solve absolute value, radical, polynomial, rational, exponential, and logarithmic equations with both real and complex solutions.",
      "SLO2: Use analytical, graphical, and numerical representations to solve absolute value, polynomial and rational inequalities with real solutions.",
      "SLO3: Use analytical, graphical, and numerical representations to analyze absolute value, radical, polynomial, rational, exponential and logarithmic functions with both real and complex zeros.",
      "SLO4: Use multiple methods to solve problems involving systems of equations.",
      "SLO5: Apply multiple methods to decomposing partial fractions.",
      "SLO6: Construct the composition and inverse of functions.",
      "SLO7: Use polynomial, exponential and logarithmic functions to model various real-world situations in order to analyze, draw conclusions, and make predictions.",
      "SLO8: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-172": {
    "is-active": true,
    "title": "Precalculus Trigonometry",
    "credit-hours": "4",
    "class-hours": "3",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to develop an understanding of topics which are fundamental to the study of Calculus. Emphasis is placed on the analysis of trigonometric functions in multiple representations, right and oblique triangles, vectors, polar coordinates, conic sections, and parametric equations. Upon completion, students should be able to select and use appropriate models and techniques for finding solutions to trigonometry-related problems with and without technology.",
    "slos": [
      "SLO1: Use the unit circle and right triangle definitions to evaluate and graph trigonometric functions and their inverses, to derive trigonometric identities, and to simplify trigonometric expressions.",
      "SLO2: Use multiple methods to solve problems involving trigonometric equations, right triangles, and oblique triangles.",
      "SLO3: Demonstrate knowledge of vector definitions and perform vector operations.",
      "SLO4: Convert equations and graphs between rectangular and polar coordinate systems, and apply to complex numbers.",
      "SLO5: Use multiple representations to define, construct and analyze conic sections.",
      "SLO6: Create, graph, and analyze parametric equations.",
      "SLO7: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-175": {
    "is-active": true,
    "title": "Precalculus",
    "credit-hours": "5",
    "class-hours": "4",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course provides an intense study of the topics which are fundamental to the study of calculus. Emphasis is placed on equations and inequalities, functions and their graphs, with special attention to polynomial, rational, exponential, logarithmic and trigonometric functions, and analytic trigonometry and geometry. Upon completion, students should be able to solve practical problems and use appropriate models for analysis and prediction.",
    "slos": [
      "SLO1: Use the unit circle and right triangle definitions to evaluate trigonometric functions and  their inverses.",
      "SLO2: Use the unit circle and right triangle definitions to graph trigonometric functions and  their inverses.",
      "SLO3: Use the unit circle and right triangle definitions to derive trigonometric identities.",
      "SLO4: Use the unit circle and right triangle definitions to simplify trigonometric expressions.",
      "SLO5: Use multiple methods to solve problems involving trigonometric equations, right triangles and oblique triangles.",
      "SLO6: Use vector definitions to perform vector operations.",
      "SLO7: Convert equations and graphs between rectangular and polar coordinate systems.",
      "SLO8: Apply polar coordinate systems to complex numbers.",
      "SLO9: Use multiple representations to define conic sections.",
      "SLO10: Use multiple representations to construct conic sections.",
      "SLO11: Use multiple representations to analyze conic sections.",
      "SLO12: Create parametric equations.",
      "SLO13: Graph parametric equations.",
      "SLO14: Analyze parametric equations.",
      "SLO15: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-223": {
    "is-active": true,
    "title": "Applied Calculus",
    "credit-hours": "3",
    "class-hours": "2",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course provides an introduction to the calculus concepts of differentiation and integration by way of application and is designed for engineering technology students. Topics include limits, slope, derivatives, related rates, areas, integrals, and applications. Upon completion, students should be able to demonstrate an understanding of the use of calculus and technology to solve problems and to analyze and communicate results.",
    "slos": [
      "SLO1: ",
      "SLO2: ",
      "SLO3: ",
      "SLO4: ",
      "SLO5: ",
      "SLO6: ",
      "SLO7: ",
      "SLO8: "
    ]
  },
  "MAT-252": {
    "is-active": true,
    "title": "Statistical Methods II",
    "credit-hours": "4",
    "class-hours": "3",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to provide a technology-based treatment of multiple sample inferential statistics. Emphasis is placed on two sample hypothesis tests and confidence intervals, linear and multiple regression, analysis of variance, experimental design, and non-parametric techniques. Upon completion, students should be able to draw statistical inferences and communicate results on multiple sample data taken from business and health, social, natural, and applied sciences.",
    "slos": [
      "SLO1: ",
      "SLO2: ",
      "SLO3: ",
      "SLO4: ",
      "SLO5: ",
      "SLO6: ",
      "SLO7: ",
      "SLO8: "
    ]
  },
  "MAT-263": {
    "is-active": true,
    "title": "Brief Calculus",
    "credit-hours": "4",
    "class-hours": "3",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to introduce concepts of differentiation and integration and their applications to solving problems. Topics include graphing, differentiation, and integration with emphasis on applications drawn from business, economics, and biological and behavioral sciences. Upon completion, students should be able to demonstrate an understanding of the use of basic calculus and technology to solve problems and to analyze and communicate results.",
    "slos": [
      "SLO1: Calculate limits.",
      "SLO2: Verify limits using graphical, numerical, and analytical methods.",
      "SLO3: Interpret the derivative as a rate of change.",
      "SLO4: Analyze the derivative of algebraic, exponential, and logarithmic functions.",
      "SLO5: Interpret the derivative of algebraic, exponential, and logarithmic functions.Evaluate antiderivatives and definite integrals of algebraic, exponential, and logarithmic functions.",
      "SLO6: Evaluate antiderivatives and definite integrals of algebraic, exponential, and logarithmic functions.",
      "SLO7: Apply derivatives and integrals to business, economics, and biological and behavioral sciences contexts.",
      "SLO8: Use appropriate technology and communicate results through various methods.",
      "SLO9: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-271": {
    "is-active": true,
    "title": "Template Course",
    "credit-hours": "4",
    "class-hours": "3",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to develop the topics of differential and integral calculus. Emphasis is placed on limits, continuity, derivatives and integrals of algebraic and transcendental functions of one variable. Upon completion, students should be able to select and use appropriate models and techniques for finding solutions to derivative-related problems with and without technology.",
    "slos": [
      "SLO1: Evaluate limits using multiple methods.  ",
      "SLO2: Use the definition of limit to derive the definition and rules for differentiation and integration.",
      "SLO3: Use derivatives to analyze algebraic and transcendental functions.",
      "SLO4: Use derivatives to graph algebraic and transcendental functions.",
      "SLO5: Identify appropriate models and differentiation techniques to solve problems involving algebraic and transcendental functions; these problems will include but are not limited to applications involving optimization and related rates.",
      "SLO6: Apply appropriate models and differentiation techniques to solve problems involving algebraic and transcendental functions; these problems will include but are not limited to applications involving optimization and related rates.",
      "SLO7: Apply the definition of indefinite integral to solve basic differential equations.",
      "SLO8: Apply the definition of definite integral to evaluate basic integrals.",
      "SLO9: Use the fundamental theorem of calculus to evaluate integrals involving algebraic and transcendental functions.",
      "SLO10: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-272": {
    "is-active": true,
    "title": "Calculus II",
    "credit-hours": "3",
    "class-hours": "3",
    "lab-hours": "0",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to develop advanced topics of differential and integral calculus. Emphasis is placed on the applications of definite integrals, techniques of integration, indeterminate forms, improper integrals, infinite series, conic sections, parametric equations, polar coordinates, and differential equations. Upon completion, students should be able to select and use appropriate models and techniques for finding solutions to integral-related problems with and without technology.",
    "slos": [
      "SLO1: Select appropriate models and integration techniques to solve problems involving algebraic and transcendental functions; these problems will include but are not limited to applications involving volume, arc length, surface area, centroids, force and work.",
      "SLO2: Apply appropriate models and integration techniques to solve problems involving algebraic and transcendental functions; these problems will include but are not limited to applications involving volume, arc length, surface area, centroids, force and work.",
      "SLO3: Evaluate proper and improper integrals using various integration techniques.",
      "SLO4: Analyze the convergence and divergence of infinite sequences and series.",
      "SLO5: Find the Taylor and McLaurin representations for transcendental functions.",
      "SLO6: Use differentiation and integration to analyze the graphs of polar form equations and parametric form equations.",
      "SLO7: Solve separable and first-order linear differential equations.",
      "SLO8: Analyze conic sections using calculus techniques.",
      "SLO9: Graph conic sections using calculus techniques.",
      "SLO10: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-273": {
    "is-active": true,
    "title": "Calculus III",
    "credit-hours": "4",
    "class-hours": "3",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course is designed to develop the topics of multivariate calculus. Emphasis is placed on multivariate functions, partial derivatives, multiple integration, solid analytical geometry, vector valued functions, and line and surface integrals. Upon completion, students should be able to select and use appropriate models and techniques for finding the solution to multivariate-related problems with and without technology.",
    "slos": [
      "SLO1: Perform operations with vectors in two and three dimensional space.",
      "SLO2: Apply operations with vectors to analytic geometry.",
      "SLO3: Differentiate vector-valued functions.",
      "SLO4: Integrate vector-valued functions.",
      "SLO5: Apply calculus to motion problems in two and three dimensional space.",
      "SLO6: Determine the limits, derivatives, gradients, and integrals of multivariate functions.",
      "SLO7: Solve problems in multiple integration using rectangular, cylindrical, and spherical coordinate systems.",
      "SLO8: Select appropriate models and techniques to define and evaluate line and surface integrals; these techniques will include but are not limited to Green’s, Divergence, and Stoke’s theorems.",
      "SLO9: Apply appropriate models and techniques to define and evaluate line and surface integrals; these techniques will include but are not limited to Green’s, Divergence, and Stoke’s theorems.",
      "SLO10: Use CAS technology to analyze various applications.",
      "SLO11: Use CAS technology to solve various applications.",
      "SLO12: Use results from CAS technology to interpret various applications.",
      "SLO13: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-280": {
    "is-active": true,
    "title": "Linear Algebra",
    "credit-hours": "2",
    "class-hours": "2",
    "lab-hours": "0",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course provides an introduction to linear algebra topics. Emphasis is placed on the development of abstract concepts and applications for vectors, systems of equations, matrices, determinants, vector spaces, multi-dimensional linear transformations, eigenvectors, eigenvalues, diagonalization and orthogonality. Upon completion, students should be able to demonstrate understanding of the theoretical concepts and select and use appropriate models and techniques for finding solutions to linear algebra-related problems with and without technology.",
    "slos": [
      "SLO1: Use analytical and graphical representations to apply vector operations in multiple dimensions.",
      "SLO2: Solve systems of linear equations using multiple manual and technology-based methods; these methods will include but are not limited to Gaussian and Gauss-Jordan Elimination.",
      "SLO3: Use eigenvalues, eigenvectors and diagonalization to solve problems in appropriate situations.",
      "SLO4: Use matrix operations and linear transformations to solve problems in appropriate situations.",
      "SLO5: Apply orthogonal projections and orthogonal complements of subspaces to appropriate situations.",
      "SLO6: Use the fundamental concept of a basis for a subspace to give a precise definition of dimensions and rank.",
      "SLO7: Use the fundamental concept of a basis for a subspace to solve problems in appropriate situations.",
      "SLO8: Use CAS technology to analyze various applications.",
      "SLO9: Use CAS technology to solve various applications.",
      "SLO10: Use results from CAS technology to interpret various applications.",
      "SLO11: Apply quantitative reasoning to solve problems."
    ]
  },
  "MAT-285": {
    "is-active": true,
    "title": "Differential Equations",
    "credit-hours": "3",
    "class-hours": "2",
    "lab-hours": "2",
    "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
    "catalog-description": "This course provides an introduction to topics involving ordinary differential equations. Emphasis is placed on the development of abstract concepts and applications for first-order and linear higher-order differential equations, systems of differential equations, numerical methods, series solutions, eigenvalues and eigenvectors, and LaPlace transforms. Upon completion, students should be able to demonstrate understanding of the theoretical concepts and select and use appropriate models and techniques for finding solutions to differential equations-related problems with and without technology.",
    "slos": [
      "SLO1: Find general solutions to first-order, second-order, and higher-order homogeneous and non-homogeneous differential equations by manual and technology-based methods.",
      "SLO2: Identify initial and boundary values to find particular solutions to first-order, second-order, and higher order homogeneous and non-homogeneous differential equations by manual and technology-based methods.",
      "SLO3: Apply initial and boundary values to find particular solutions to first-order, second-order, and higher order homogeneous and non-homogeneous differential equations by manual and technology-based methods.",
      "SLO4: Analyze initial and boundary values to find particular solutions to first-order, second-order, and higher order homogeneous and non-homogeneous differential equations by manual and technology-based methods.",
      "SLO5: Interpret the results of initial and boundary values to find particular solutions to first-order, second-order, and higher order homogeneous and non-homogeneous differential equations by manual and technology-based methods.",
      "SLO6: Select appropriate methods to solve differential equations; these methods will include, but are not limited to, undetermined coefficients, variation of parameters, eigenvalues and eigenvectors, LaPlace and inverse LaPlace transforms.",
      "SLO7: Apply appropriate methods to solve differential equations; these methods will include, but are not limited to, undetermined coefficients, variation of parameters, eigenvalues and eigenvectors, LaPlace and inverse LaPlace transforms.",
      "SLO8: Select series techniques to solve differential equations; these techniques will include but are not limited to Taylor series.",
      "SLO9: Apply series techniques to solve differential equations; these techniques will include but are not limited to Taylor series.",
      "SLO10: Select numerical analysis techniques to solve differential equations; these techniques will include but are not limited to Euler, Improved Euler, and Runge-Kutta.",
      "SLO11: Apply numerical analysis techniques to solve differential equations; these techniques will include but are not limited to Euler, Improved Euler, and Runge-Kutta.",
      "SLO12: Use CAS technology to analyze various applications.",
      "SLO13: Use CAS technology to solve various applications.",
      "SLO14: Use results from CAS technology to interpret various applications.",
      "SLO15: Apply quantitative reasoning to solve problems."
    ]
  }
}